koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/USART_STM32F1xx.c
/* UART4 */
#ifdef USE_UART4

/* UART4 Run-Time Information */
static USART_INFO          UART4_Info = {0};
static USART_TRANSFER_INFO UART4_TransferInfo = {0};

#ifdef USE_UART4_TX_Pin
  static USART_PIN UART4_tx = {UART4_TX_GPIOx,  UART4_TX_GPIO_Pin};
#endif
#ifdef USE_UART4_RX_Pin
  static USART_PIN UART4_rx = {UART4_RX_GPIOx,  UART4_RX_GPIO_Pin};
#endif

#ifdef UART4_TX_DMA_Instance
  static USART_DMA UART4_DMA_Tx = {
    UART4_TX_DMA_Instance,
    UART4_TX_DMA_Channel,
    UART4_TX_DMA_Priority,
    UART4_TX_DMA_IRQn
  };
#endif
#ifdef UART4_RX_DMA_Instance
  static USART_DMA UART4_DMA_Rx = {
    UART4_RX_DMA_Instance,
    UART4_RX_DMA_Channel,
    UART4_RX_DMA_Priority,
    UART4_RX_DMA_IRQn
  };
#endif

/* UART4 Resources */
static const USART_RESOURCES USART4_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  UART4,
  RCC_PERIPH_UART4,
  // PINS
  {
#ifdef USE_UART4_TX_Pin
    &UART4_tx,
#else
    NULL,
#endif
#ifdef USE_UART4_RX_Pin
    &UART4_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
    UART4_REMAP_DEF,
    UART4_REMAP,
  },
  UART4_IRQn,
#ifdef UART4_TX_DMA_Instance
  &UART4_DMA_Tx,
#else
  NULL,
#endif
#ifdef UART4_RX_DMA_Instance
  &UART4_DMA_Rx,
#else
  NULL,
#endif
  &UART4_Info,
  &UART4_TransferInfo
};
#endif

/* UART5 */
#ifdef USE_UART5

/* UART5 Run-Time Information */
static USART_INFO          UART5_Info = {0};
static USART_TRANSFER_INFO UART5_TransferInfo = {0};

#ifdef USE_UART5_TX_Pin
  static USART_PIN UART5_tx = {UART5_TX_GPIOx,  UART5_TX_GPIO_Pin};
#endif
#ifdef USE_UART5_RX_Pin
  static USART_PIN UART5_rx = {UART5_RX_GPIOx,  UART5_RX_GPIO_Pin};
#endif

#ifdef UART5_TX_DMA_Instance
  static USART_DMA UART5_DMA_Tx = {
    UART5_TX_DMA_Instance,
    UART5_TX_DMA_Channel,
    UART5_TX_DMA_Priority,
    UART5_TX_DMA_IRQn
  };
#endif

#ifdef UART5_RX_DMA_Instance
  static USART_DMA UART5_DMA_Rx = {
    UART5_RX_DMA_Instance,
    UART5_RX_DMA_Channel,
    UART5_RX_DMA_Priority,
    UART5_RX_DMA_IRQn
  };
#endif

// UART5 Resources
static const USART_RESOURCES USART5_Resources = {
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref USART_EVENT_CTS
    0,  // Signal DSR change event: \ref USART_EVENT_DSR
    0,  // Signal DCD change event: \ref USART_EVENT_DCD
    0,  // Signal RI change event: \ref USART_EVENT_RI
  },
  UART5,
  RCC_PERIPH_UART5,
  // PINS
  {
#ifdef USE_UART5_TX_Pin
    &UART5_tx,
#else
    NULL,
#endif
#ifdef USE_UART5_RX_Pin
    &UART5_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
    UART5_REMAP_DEF,
    UART5_REMAP,
  },
  UART5_IRQn,
#ifdef UART5_TX_DMA_Instance
  &UART5_DMA_Tx,
#else
  NULL,
#endif
#ifdef UART5_RX_DMA_Instance
  &UART5_DMA_Rx,
#else
  NULL,
#endif
  &UART5_Info,
  &UART5_TransferInfo
};
#endif

/*******************************************************************************
 *  function implementations (scope: module-local)
 ******************************************************************************/

/**
 * @fn          void PinConfig(const USART_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
 * @brief       Configure Pin
 * @param[in]   io       Pointer to SPI_PIN
 * @param[in]   pin_cfg  Pointer to GPIO_PIN_CFG_t
 */
static
void PinConfig(const USART_PIN *io, const GPIO_PIN_CFG_t *pin_cfg)
{
  if ((io == NULL) || (pin_cfg == NULL))
    return;

  if (GPIO_GetPortClockState(io->port) == GPIO_PORT_CLK_DISABLE)
    GPIO_PortClock(io->port, GPIO_PORT_CLK_ENABLE);

  GPIO_PinConfig(io->port, io->pin, pin_cfg);
}

/**
 * @fn          DRIVER_VERSION USARTx_GetVersion(void)
 * @brief       Get driver version.
 * @return      \ref DRIVER_VERSION
 */
static DRIVER_VERSION USARTx_GetVersion(void)
{
  return (usart_driver_version);
}

/**
 * @fn          USART_CAPABILITIES USART_GetCapabilities(const USART_RESOURCES *usart)
 * @brief       Get driver capabilities
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref USART_CAPABILITIES
 */
static USART_CAPABILITIES USART_GetCapabilities(const USART_RESOURCES *usart)
{
  return (usart->capabilities);
}

/**
 * @fn          int32_t USART_Initialize(USART_SignalEvent_t cb_event, const USART_RESOURCES *usart)
 * @brief       Initialize USART Interface.
 * @param[in]   cb_event  Pointer to \ref USART_SignalEvent
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Initialize(USART_SignalEvent_t cb_event, const USART_RESOURCES *usart)
{
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  if (info->flags & USART_FLAG_INITIALIZED) {
    /* Driver is already initialized */
    return DRIVER_OK;
  }

  /* Initialize USART Run-time Resources */
  info->cb_event = cb_event;

  info->status.tx_busy = 0U;
  info->status.rx_busy = 0U;
  info->status.tx_underflow = 0U;
  info->status.rx_overflow = 0U;
  info->status.rx_break = 0U;
  info->status.rx_framing_error = 0U;
  info->status.rx_parity_error = 0U;

  info->mode = 0U;
  xfer->send_active = 0U;

  /* Clear transfer information */
  memset(xfer, 0, sizeof(USART_TRANSFER_INFO));

  /* Setup pin remap */
  GPIO_AFConfig(usart->io.afio);

  info->flags = USART_FLAG_INITIALIZED;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Uninitialize(const USART_RESOURCES *usart)
 * @brief       De-initialize USART Interface.
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Uninitialize(const USART_RESOURCES *usart)
{
  USART_IO *io = &usart->io;
  const GPIO_PIN_CFG_t *pin_cfg = &USART_pin_cfg_analog;

