koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/USART_STM32F1xx.c
  /* Unconfigure USART pins */
  PinConfig(io->tx, pin_cfg);
  PinConfig(io->rx, pin_cfg);
  PinConfig(io->ck, pin_cfg);
  PinConfig(io->rts, pin_cfg);
  PinConfig(io->cts, pin_cfg);

  /* Unconfigure pin remap */
  GPIO_AFConfig(io->afio_def);

  /* Reset USART status flags */
  usart->info->flags = 0U;

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_PowerControl(POWER_STATE state)
 * @brief       Control USART Interface Power.
 * @param[in]   state  Power state
 * @param[in]   usart  Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_PowerControl(POWER_STATE state, const USART_RESOURCES *usart)
{
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  switch (state) {
    case POWER_OFF:
      /* Peripheral reset */
      RCC_ResetPeriph(usart->periph);
      /* Disable IRQ */
      NVIC_DisableIRQ(usart->irq_num);

#ifdef __USART_DMA
      /* Deinitialize DMA */
      DMA_ChannelUninitialize((DMA_INFO *)usart->dma_rx);
      DMA_ChannelUninitialize((DMA_INFO *)usart->dma_tx);
#endif

      /* Disable USART clock */
      RCC_DisablePeriph(usart->periph);

      /* Clear Status flags */
      info->status.tx_busy = 0U;
      info->status.rx_busy = 0U;
      info->status.tx_underflow = 0U;
      info->status.rx_overflow = 0U;
      info->status.rx_break = 0U;
      info->status.rx_framing_error = 0U;
      info->status.rx_parity_error = 0U;
      xfer->send_active = 0U;

      info->flags &= ~USART_FLAG_POWERED;
      break;

    case POWER_FULL:
      if ((info->flags & USART_FLAG_INITIALIZED) == 0U)
        return (DRIVER_ERROR);

      if ((info->flags & USART_FLAG_POWERED) != 0U)
        return (DRIVER_OK);

      /* Clear Status flags */
      info->status.tx_busy = 0U;
      info->status.rx_busy = 0U;
      info->status.tx_underflow = 0U;
      info->status.rx_overflow = 0U;
      info->status.rx_break = 0U;
      info->status.rx_framing_error = 0U;
      info->status.rx_parity_error = 0U;

      xfer->send_active = 0U;
      xfer->def_val = 0U;
      xfer->sync_mode = 0U;
      xfer->break_flag = 0U;
      info->mode = 0U;
      info->flow_control = 0U;

      info->flags |= USART_FLAG_POWERED;

      /* Enable USART clock */
      RCC_EnablePeriph(usart->periph);

      /* Clear and Enable USART IRQ */
      NVIC_ClearPendingIRQ(usart->irq_num);
      NVIC_SetPriority(usart->irq_num, DEV_USART_INT_PRIORITY);
      NVIC_EnableIRQ(usart->irq_num);

#ifdef __USART_DMA
      /* Initialize DMA */
      DMA_ChannelInitialize((DMA_INFO *)usart->dma_rx);
      DMA_ChannelInitialize((DMA_INFO *)usart->dma_tx);
#endif

      /* Peripheral reset */
      RCC_ResetPeriph(usart->periph);
      break;

    case POWER_LOW:
    default:
      return (DRIVER_ERROR_UNSUPPORTED);
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Send(const void *data, uint32_t num, const USART_RESOURCES *usart)
 * @brief       Start sending data to USART transmitter.
 * @param[in]   data  Pointer to buffer with data to send to USART transmitter
 * @param[in]   num   Number of data items to send
 * @param[in]   usart Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Send(const void *data, uint32_t num, const USART_RESOURCES *usart)
{
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  USART_TypeDef *reg = usart->reg;
  uint32_t cr1;

#ifdef __USART_DMA_TX
  uint32_t cfg;
#endif

  if ((data == NULL) || (num == 0U)) {
    /* Invalid parameters */
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->flags & USART_FLAG_CONFIGURED) == 0U) {
    /* USART is not configured (mode not selected) */
    return DRIVER_ERROR;
  }

  if (xfer->send_active != 0U) {
    /* Send is not completed yet */
    return DRIVER_ERROR_BUSY;
  }

  cr1 = reg->CR1;

  /* Set Send active flag */
  xfer->send_active = 1U;

  /* Save transmit buffer info */
  xfer->tx_buf = (uint8_t *)data;
  xfer->tx_num = num;
  xfer->tx_cnt = 0U;

#ifdef __USART_DMA_TX
  cfg = DMA_MEMORY_INCREMENT;
#endif

  /* Synchronous mode */
  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    if (xfer->sync_mode == 0U) {
      xfer->sync_mode = USART_SYNC_MODE_TX;
      /* Start dummy reads */
      int32_t stat = USART_Receive(&xfer->dump_val, num, usart);
      if (stat == DRIVER_ERROR_BUSY) {
        return (DRIVER_ERROR_BUSY);
      }

#ifdef __USART_DMA_TX
    }
    else {
      if (xfer->sync_mode == USART_SYNC_MODE_RX) {
        /* Dummy DMA writes (do not increment source address) */
        cfg = 0;
      }
#endif
    }
  }

#ifdef __USART_DMA_TX
  /* DMA mode */
  if (usart->dma_tx) {
    /* Configure and enable tx DMA channel */
    cfg |= (DMA_PRIORITY(usart->dma_tx->priority) | DMA_MEMORY_TO_PERIPHERAL | DMA_TRANSFER_COMPLETE_INTERRUPT);

    if (((cr1 & USART_CR1_M) != 0U) && ((cr1 & USART_CR1_PCE) == 0U)) {
      // 9-bit data frame, no parity
      cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
    }

    DMA_ChannelConfigure(usart->dma_tx->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)data, num);
    DMA_ChannelEnable(usart->dma_tx->instance);

    /* DMA Enable transmitter */
    reg->CR3 |= USART_CR3_DMAT;
  }
  else
#endif
  {
    /* Interrupt mode */
    /* TXE interrupt enable */
    reg->CR1 = cr1 | USART_CR1_TXEIE;
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Receive(void *data, uint32_t num, const USART_RESOURCES *usart)
 * @brief       Start receiving data from USART receiver.
 * @param[out]  data  Pointer to buffer for data to receive from USART receiver
 * @param[in]   num   Number of data items to receive
 * @param[in]   usart Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Receive(void *data, uint32_t num, const USART_RESOURCES *usart)
{
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  USART_TypeDef *reg = usart->reg;
  uint32_t cr1;

#ifdef __USART_DMA_RX
  uint32_t cfg;
#endif

