koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/USART_STM32F1xx.c
  if ((data == NULL) || (num == 0U)) {
    /* Invalid parameters */
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->flags & USART_FLAG_CONFIGURED) == 0U) {
    /* USART is not configured (mode not selected) */
    return (DRIVER_ERROR);
  }

  /* Check if receiver is busy */
  if (info->status.rx_busy == 1U) {
    return (DRIVER_ERROR_BUSY);
  }

  /* Disable RXNE Interrupt */
  reg->CR1 &= ~USART_CR1_RXNEIE;

  /* Save number of data to be received */
  xfer->rx_num = num;

  /* Clear RX statuses */
  info->status.rx_break = 0U;
  info->status.rx_framing_error = 0U;
  info->status.rx_overflow = 0U;
  info->status.rx_parity_error = 0U;

  /* Save receive buffer info */
  xfer->rx_buf = (uint8_t *)data;
  xfer->rx_cnt = 0U;

  /* Set RX busy flag */
  info->status.rx_busy = 1U;

  cr1 = reg->CR1;

#ifdef __USART_DMA_RX

  cfg = DMA_MEMORY_INCREMENT;

  /* Synchronous mode */
  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    if (xfer->sync_mode == USART_SYNC_MODE_TX) {
      /* Dummy DMA reads (do not increment destination address) */
      cfg = 0U;
    }
  }

  /* DMA mode */
  if (usart->dma_rx) {
    /* Configure and enable rx DMA channel */
    cfg |= DMA_PRIORITY(usart->dma_rx->priority) | DMA_PERIPHERAL_TO_MEMORY | DMA_TRANSFER_COMPLETE_INTERRUPT;

    if (((cr1 & USART_CR1_M) != 0U) && ((cr1 & USART_CR1_PCE) == 0U)) {
      /* 9-bit data frame, no parity */
      cfg |= DMA_PERIPHERAL_DATA_16BIT | DMA_MEMORY_DATA_16BIT;
    }

    DMA_ChannelConfigure(usart->dma_rx->instance, cfg, (uint32_t)(&reg->DR), (uint32_t)data, num);
    DMA_ChannelEnable(usart->dma_rx->instance);

    reg->CR3 |= USART_CR3_DMAR;
    /* Enable IDLE interrupt */
    reg->CR1 = cr1 | USART_CR1_IDLEIE;
  }
  else
#endif
  {
    /* Enable RXNE and IDLE interrupt */
    reg->CR1 = cr1 | USART_CR1_IDLEIE | USART_CR1_RXNEIE;
  }

  /* Synchronous mode */
  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    if (xfer->sync_mode == 0U) {
      xfer->sync_mode = USART_SYNC_MODE_RX;
      /* Send dummy data */
      int32_t stat = USART_Send(&xfer->def_val, num, usart);
      if (stat == DRIVER_ERROR_BUSY) {
        return DRIVER_ERROR_BUSY;
      }
    }
  }

  return (DRIVER_OK);
}

/**
 * @fn          int32_t USART_Transfer(const void *data_out, void *data_in, uint32_t num, const USART_RESOURCES *usart)
 * @brief       Start sending/receiving data to/from USART transmitter/receiver.
 * @param[in]   data_out  Pointer to buffer with data to send to USART transmitter
 * @param[out]  data_in   Pointer to buffer for data to receive from USART receiver
 * @param[in]   num       Number of data items to transfer
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_Transfer(const void *data_out, void *data_in, uint32_t num, const USART_RESOURCES *usart)
{
  int32_t status;
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  if ((data_out == NULL) || (data_in == NULL) || (num == 0U)) {
    /* Invalid parameters */
    return (DRIVER_ERROR_PARAMETER);
  }

  if ((info->flags & USART_FLAG_CONFIGURED) == 0U) {
    /* USART is not configured */
    return (DRIVER_ERROR);
  }

  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    /* Set transfer mode */
    xfer->sync_mode = USART_SYNC_MODE_TX_RX;

    /* Receive */
    status = USART_Receive(data_in, num, usart);
    if (status != DRIVER_OK) {
      return (status);
    }

    /* Send */
    status = USART_Send(data_out, num, usart);
    if (status != DRIVER_OK) {
      return (status);
    }

  }
  else {
    /* Only in synchronous mode */
    return (DRIVER_ERROR);
  }

  return (DRIVER_OK);
}

/**
 * @fn          uint32_t USART_GetTxCount(const USART_RESOURCES *usart)
 * @brief       Get transmitted data count.
 * @param[in]   usart     Pointer to USART resources
 * @return      number of data items transmitted
 */
static
uint32_t USART_GetTxCount(const USART_RESOURCES *usart)
{
#ifdef __USART_DMA_TX
  if (usart->dma_tx) {
    return (usart->xfer->tx_num - DMA_ChannelTransferItemCount(usart->dma_tx->instance));
  }
  else
#endif
  {
    return (usart->xfer->tx_cnt);
  }
}

/**
 * @fn          uint32_t USART_GetRxCount(const USART_RESOURCES *usart)
 * @brief       Get received data count.
 * @param[in]   usart     Pointer to USART resources
 * @return      number of data items received
 */
static
uint32_t USART_GetRxCount(const USART_RESOURCES *usart)
{
#ifdef __USART_DMA_RX
  if (usart->dma_rx) {
    return (usart->xfer->rx_num - DMA_ChannelTransferItemCount(usart->dma_rx->instance));
  }
  else
#endif
  {
    return (usart->xfer->rx_cnt);
  }
}

/**
 * @fn          int32_t USART_Control(uint32_t control, uint32_t arg, const USART_RESOURCES *usart)
 * @brief       Control USART Interface.
 * @param[in]   control  Operation
 * @param[in]   arg      Argument of operation (optional)
 * @param[in]   usart    Pointer to USART resources
 * @return      common \ref execution_status and driver specific \ref usart_execution_status
 */
static
int32_t USART_Control(uint32_t control, uint32_t arg, const USART_RESOURCES *usart)
{
  uint32_t val, mode, flow_control, br, i;
  uint32_t cr1, cr2, cr3;
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  USART_TypeDef *reg = usart->reg;

  if ((info->flags & USART_FLAG_POWERED) == 0U) {
    /* USART not powered */
    return (DRIVER_ERROR);
  }

  cr1 = 0U;
  cr2 = 0U;
  cr3 = 0U;

  switch (control & USART_CONTROL_Msk) {
    /* Control break */
    case USART_CONTROL_BREAK:
      if (arg) {
        if (xfer->send_active != 0U) {
          return (DRIVER_ERROR_BUSY);
        }

        /* Set Send active and Break flag */
        xfer->send_active = 1U;
        xfer->break_flag = 1U;

        /* Enable TX interrupt and send break */
        reg->CR1 |= USART_CR1_TXEIE | USART_CR1_SBK;
      }
      else {
        if (xfer->break_flag) {
          /* Disable TX interrupt */
          reg->CR1 &= ~USART_CR1_TXEIE;

          /* Clear break and Send Active flag */
          xfer->break_flag = 0U;
          xfer->send_active = 0U;
        }
      }
      return (DRIVER_OK);

    /* Abort Send */
    case USART_ABORT_SEND:
      /* Disable TX and TC interrupt */
      reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE);

