koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/USART_STM32F1xx.c
      /* If DMA mode - disable DMA channel */
      if ((usart->dma_tx != NULL) && (xfer->send_active != 0)) {
        /* DMA disable transmitter */
        reg->CR3 &= ~USART_CR3_DMAT;

        /* Abort TX DMA transfer */
        DMA_ChannelDisable(usart->dma_tx->instance);
      }

      /* Clear break flag */
      xfer->break_flag = 0U;
      /* Clear Send active flag */
      xfer->send_active = 0U;
      return (DRIVER_OK);

    /* Abort receive */
    case USART_ABORT_RECEIVE:
      /* Disable RX interrupt */
      reg->CR1 &= ~USART_CR1_RXNEIE;

      /* If DMA mode - disable DMA channel */
      if ((usart->dma_rx != NULL) && (info->status.rx_busy != 0)) {
        /* DMA disable Receiver */
        reg->CR3 &= ~USART_CR3_DMAR;

        /* Abort RX DMA transfer */
        DMA_ChannelDisable(usart->dma_rx->instance);
      }

      /* Clear RX busy status */
      info->status.rx_busy = 0U;
      return (DRIVER_OK);

    /* Abort transfer */
    case USART_ABORT_TRANSFER:
      /* Disable TX, TC and RX interrupt */
      reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE | USART_CR1_RXNEIE);

      /* If DMA mode - disable DMA channel */
      if ((usart->dma_tx != NULL) && (xfer->send_active != 0U)) {
        /* DMA disable transmitter */
        reg->CR3 &= ~USART_CR3_DMAT;

        /* Abort TX DMA transfer */
        DMA_ChannelDisable(usart->dma_tx->instance);
      }

      /* If DMA mode - disable DMA channel */
      if ((usart->dma_rx != NULL) && (info->status.rx_busy != 0U)) {
        /* DMA disable Receiver */
        reg->CR3 &= ~USART_CR3_DMAR;

        /* Abort RX DMA transfer */
        DMA_ChannelDisable(usart->dma_rx->instance);
      }

      /* Clear busy statuses */
      info->status.rx_busy = 0U;
      xfer->send_active = 0U;
      return (DRIVER_OK);

    /* Control TX */
    case USART_CONTROL_TX:
      /* Check if TX pin available */
      if (usart->io.tx == NULL)
        return (DRIVER_ERROR);

      if (arg) {
        if (info->mode != USART_MODE_SMART_CARD) {
          /* USART TX pin function selected */
          PinConfig(usart->io.tx, &USART_pin_cfg_af);
        }
        info->flags |= USART_FLAG_TX_ENABLED;

        /* Transmitter enable */
        reg->CR1 |= USART_CR1_TE;
      }
      else {
        /* Transmitter disable */
        reg->CR1 &= ~USART_CR1_TE;

        info->flags &= ~USART_FLAG_TX_ENABLED;

        if (info->mode != USART_MODE_SMART_CARD) {
          /* GPIO pin function selected */
          PinConfig(usart->io.tx, &USART_pin_cfg_analog);
        }
      }
      return (DRIVER_OK);

    /* Control RX */
    case USART_CONTROL_RX:
      /* Check if RX line available */
      if (usart->io.rx == NULL)
        return (DRIVER_ERROR);

      if (arg) {
        if ((info->mode != USART_MODE_SMART_CARD) && (info->mode != USART_MODE_SINGLE_WIRE)) {
          /* USART RX pin function selected */
          PinConfig(usart->io.rx, &USART_pin_cfg_input);
        }
        info->flags |= USART_FLAG_RX_ENABLED;

        /* Enable Error interrupt */
        reg->CR3 |= USART_CR3_EIE;
        /* Break detection interrupt enable */
        reg->CR2 |= USART_CR2_LBDIE;
        /* Enable Idle line interrupt */
        reg->CR1 |= USART_CR1_IDLEIE;

        if (((info->status.rx_busy != 0U) && (usart->dma_rx != NULL)) == false) {
          reg->CR1 |= USART_CR1_RXNEIE;
        }

        /* Receiver enable */
        reg->CR1 |= USART_CR1_RE;
      }
      else {
        /* Receiver disable */
        reg->CR1 &= ~USART_CR1_RE;

        info->flags &= ~USART_FLAG_RX_ENABLED;

        if ((info->mode != USART_MODE_SMART_CARD) && (info->mode != USART_MODE_SINGLE_WIRE)) {
          /* GPIO pin function selected */
          PinConfig(usart->io.rx, &USART_pin_cfg_analog);
        }
      }
      return (DRIVER_OK);

    default:
      break;
  }

  /* Check if busy */
  if ((info->status.rx_busy != 0U) || (xfer->send_active != 0U))
    return (DRIVER_ERROR_BUSY);

  if (((reg->CR1 & USART_CR1_TE) != 0U) && ((reg->SR & USART_SR_TC) == 0U))
    return DRIVER_ERROR_BUSY;

  switch (control & USART_CONTROL_Msk) {
    case USART_MODE_ASYNCHRONOUS:
      mode = USART_MODE_ASYNCHRONOUS;
      break;

    case USART_MODE_SYNCHRONOUS_MASTER:
      if (usart->capabilities.synchronous_master) {
        /* Enable Clock pin and last bit clock pulse */
        cr2 |= USART_CR2_CLKEN | USART_CR2_LBCL;
      }
      else {
        return (USART_ERROR_MODE);
      }
      mode = USART_MODE_SYNCHRONOUS_MASTER;
      break;

    case USART_MODE_SYNCHRONOUS_SLAVE:
      return (USART_ERROR_MODE);

    case USART_MODE_SINGLE_WIRE:
      /* Enable Half duplex */
      cr3 |= USART_CR3_HDSEL;
      mode = USART_MODE_SINGLE_WIRE;
      break;

    case USART_MODE_IRDA:
      /* Enable IrDA mode */
      cr3 |= USART_CR3_IREN;
      mode = USART_MODE_IRDA;
      break;

    case USART_MODE_SMART_CARD:
      if (usart->capabilities.smart_card) {
        /* Enable Smart card mode */
        cr3 |= USART_CR3_SCEN;
      }
      else {
        return (USART_ERROR_MODE);
      }
      mode = USART_MODE_SMART_CARD;
      break;

    /* Default TX value */
    case USART_SET_DEFAULT_TX_VALUE:
      xfer->def_val = (uint16_t)arg;
      return (DRIVER_OK);

    /* IrDA pulse */
    case USART_SET_IRDA_PULSE:
      if (info->mode == USART_MODE_IRDA) {
        if (arg != 0U) {
          /* IrDa low-power */
          reg->CR3 |= USART_CR3_IRLP;

          /* Get clock */
          val = RCC_GetPeriphFreq(usart->periph);

          /* Calculate period in ns */
          val = 1000000000U / val;
          for (i = 1U; i < 256U; i++) {
            if ((val * i) > arg) {
              break;
            }
          }
          if (i == 256U) {
            return (DRIVER_ERROR);
          }
          reg->GTPR = (reg->GTPR & ~USART_GTPR_PSC) | i;
        }
      }
      else {
        return (DRIVER_ERROR);
      }
      return (DRIVER_OK);

    /* SmartCard guard time */
    case USART_SET_SMART_CARD_GUARD_TIME:
      if (info->mode == USART_MODE_SMART_CARD) {
        if (arg > 255U)
          return (DRIVER_ERROR);

        reg->GTPR = (reg->GTPR & ~USART_GTPR_GT) | arg;
      }
      else {
        return (DRIVER_ERROR);
      }
      return (DRIVER_OK);

    /* SmartCard clock */
    case USART_SET_SMART_CARD_CLOCK:
      if (info->mode == USART_MODE_SMART_CARD) {
        /* Get clock */
        val = RCC_GetPeriphFreq(usart->periph);

        /* Calculate period in ns */
        val = 1000000000U / val;
        for (i = 1U; i < 64U; i++) {
          /* if in +-2% tolerance */
          if (((val * i * 2U * 100U) < (arg * 102U)) && ((val * i * 2U * 100U) > (arg * 98U))) {
            break;
          }
        }
        if (i == 64U) {
          return (DRIVER_ERROR);
        }

