koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/USART_STM32F1xx.c
        reg->GTPR = (reg->GTPR & ~USART_GTPR_PSC) | i;
      }
      else {
        return (DRIVER_ERROR);
      }
      return (DRIVER_OK);

    /* SmartCard NACK */
    case USART_CONTROL_SMART_CARD_NACK:
      if (info->mode == USART_MODE_SMART_CARD) {
        /* SmartCard NACK Enable */
        if (arg != 0U) {
          reg->CR3 |= USART_CR3_NACK;
        }
      }
      else {
        return (DRIVER_ERROR);
      }
      return (DRIVER_OK);

    /* Unsupported command */
    default:
      return DRIVER_ERROR_UNSUPPORTED;
  }

  /* USART Data bits */
  switch (control & USART_DATA_BITS_Msk) {
    case USART_DATA_BITS_7:
      if ((control & USART_PARITY_Msk) == USART_PARITY_NONE) {
        return USART_ERROR_DATA_BITS;
      }
      /* 7 data bits, 8. data bit is parity bit */
      break;

    case USART_DATA_BITS_8:
      if ((control & USART_PARITY_Msk) == USART_PARITY_NONE) {
        /* 8-data bits, no parity */
      }
      else {
        /* 11-bit break detection */
        cr2 |= USART_CR2_LBDL;
        /* 8-data bits, 9. bit is parity bit */
        cr1 |= USART_CR1_M;
      }
      break;

    case USART_DATA_BITS_9:
      if ((control & USART_PARITY_Msk) != USART_PARITY_NONE) {
        return USART_ERROR_DATA_BITS;
      }
      /* 11-bit break detection */
      cr2 |= USART_CR2_LBDL;
      /* 9-data bits, no parity */
      cr1 |= USART_CR1_M;
      break;

    default:
      return USART_ERROR_DATA_BITS;
  }

  /* USART Parity */
  switch (control & USART_PARITY_Msk) {
    case USART_PARITY_NONE:
      break;
    case USART_PARITY_EVEN:
      cr1 |= USART_CR1_PCE;
      break;
    case USART_PARITY_ODD:
      cr1 |= (USART_CR1_PCE | USART_CR1_PS);
      break;
    default:
      return USART_ERROR_PARITY;
  }

  /* USART Stop bits */
  switch (control & USART_STOP_BITS_Msk) {
    case USART_STOP_BITS_1:
      break;
    case USART_STOP_BITS_2:
      cr2 |= USART_CR2_STOP_1;
      break;
    case USART_STOP_BITS_1_5:
      cr2 |= USART_CR2_STOP_0 | USART_CR2_STOP_1;
      break;
    case USART_STOP_BITS_0_5:
      cr2 |= USART_CR2_STOP_0;
      break;
    default:
      return USART_ERROR_STOP_BITS;
  }

  /* USART Flow control */
  switch (control & USART_FLOW_CONTROL_Msk) {
    case USART_FLOW_CONTROL_NONE:
      flow_control = USART_FLOW_CONTROL_NONE;
      break;

    case USART_FLOW_CONTROL_RTS:
      if (usart->capabilities.flow_control_rts) {
        flow_control = USART_FLOW_CONTROL_RTS;
        /* RTS Enable */
        cr3 |= USART_CR3_RTSE;
      }
      else {
        return (USART_ERROR_FLOW_CONTROL);
      }
      break;

    case USART_FLOW_CONTROL_CTS:
      if (usart->capabilities.flow_control_cts) {
        flow_control = USART_FLOW_CONTROL_CTS;
        /* CTS Enable, CTS interrupt enable */
        cr3 |= USART_CR3_CTSE | USART_CR3_CTSIE;
      }
      else {
        return (USART_ERROR_FLOW_CONTROL);
      }
      break;

    case USART_FLOW_CONTROL_RTS_CTS:
      if ((usart->capabilities.flow_control_rts != 0U) && (usart->capabilities.flow_control_cts != 0U)) {
        flow_control = USART_FLOW_CONTROL_RTS_CTS;
        /* RTS and CTS Enable, CTS interrupt enable */
        cr3 |= (USART_CR3_RTSE | USART_CR3_CTSE | USART_CR3_CTSIE);
      }
      else {
        return (USART_ERROR_FLOW_CONTROL);
      }
      break;

    default:
      return USART_ERROR_FLOW_CONTROL;
  }

  /* Clock setting for synchronous mode */
  if (mode == USART_MODE_SYNCHRONOUS_MASTER) {
    /* Polarity */
    switch (control & USART_CPOL_Msk) {
      case USART_CPOL0:
        break;
      case USART_CPOL1:
        cr2 |= USART_CR2_CPOL;
        break;
      default:
        return USART_ERROR_CPOL;
    }

    /* Phase */
    switch (control & USART_CPHA_Msk) {
      case USART_CPHA0:
        break;
      case USART_CPHA1:
        cr2 |= USART_CR2_CPHA;
        break;
      default:
        return USART_ERROR_CPHA;
    }
  }

  /* USART Baudrate */
  uint32_t freq = RCC_GetPeriphFreq(usart->periph);
  val = (uint32_t)(USART_BAUDRATE_DIVIDER(freq, arg));
  br = ((freq << 4U) / (val & 0xFFFFU)) >> 4U;
  /* If inside +/- 2% tolerance, baud rate configured correctly */
  if (!(((br * 100U) < (arg * 102U)) && ((br * 100U) > (arg * 98U)))) {
    return (USART_ERROR_BAUDRATE);
  }

  /* USART Disable */
  reg->CR1 &= ~USART_CR1_UE;

  /* Configure Baud rate register */
  reg->BRR = val;

  /* Configuration is OK - Mode is valid */
  info->mode = mode;

  /* Save flow control mode */
  info->flow_control = flow_control;

  /* Configure TX pin regarding mode and transmitter state */
  switch (info->mode) {
    case USART_MODE_SMART_CARD:
      /* USART TX pin function selected */
      PinConfig(usart->io.tx, &USART_pin_cfg_af);
      break;

    default:
      /* Synchronous master/slave, asynchronous, single-wire and IrDA mode */
      if (info->flags & USART_FLAG_TX_ENABLED) {
        /* USART TX pin function selected */
        PinConfig(usart->io.tx, &USART_pin_cfg_af);
      }
      else {
        /* GPIO pin function selected */
        PinConfig(usart->io.tx, &USART_pin_cfg_analog);
      }
      break;
  }

  /* Configure RX pin regarding mode and receiver state */
  switch (info->mode) {
    case USART_MODE_SINGLE_WIRE:
    case USART_MODE_SMART_CARD:
      /* GPIO pin function selected */
      PinConfig(usart->io.rx, &USART_pin_cfg_analog);
      break;

    default:
      /* Synchronous master/slave, asynchronous and  IrDA mode */
      if (info->flags & USART_FLAG_RX_ENABLED) {
        /* USART RX pin function selected */
        PinConfig(usart->io.rx, &USART_pin_cfg_input);
      }
      else {
        /* GPIO pin function selected */
        PinConfig(usart->io.rx, &USART_pin_cfg_analog);
      }
      break;
  }

  /* Configure CLK pin regarding mode */
  if (usart->io.ck) {
    switch (info->mode) {
      case USART_MODE_SMART_CARD:
      case USART_MODE_SYNCHRONOUS_MASTER:
        /* USART CK pin function selected */
        PinConfig(usart->io.ck, &USART_pin_cfg_af);
        break;

      default:
        /* Asynchronous, Single-wire and IrDA mode
           GPIO pin function selected */
        PinConfig(usart->io.ck, &USART_pin_cfg_analog);
        break;
    }
  }

  /* Configure RTS pin regarding Flow control configuration */
  if (usart->io.rts) {
    if ((flow_control == USART_FLOW_CONTROL_RTS) || (flow_control == USART_FLOW_CONTROL_RTS_CTS)) {
      /* USART RTS Alternate function */
      PinConfig(usart->io.rts, &USART_pin_cfg_af);
    }
    else {
      /* GPIO output */
      PinConfig(usart->io.rts, &USART_pin_cfg_out_pp);
    }
  }

  /* Configure CTS pin regarding Flow control configuration */
  if (usart->io.cts) {
    if ((flow_control == USART_FLOW_CONTROL_CTS) || (flow_control == USART_FLOW_CONTROL_RTS_CTS)) {
      /* USART CTS Alternate function */
      PinConfig(usart->io.cts, &USART_pin_cfg_input);
    }
    else {
      /* GPIO input */
      PinConfig(usart->io.cts, &USART_pin_cfg_input);
    }
  }

  /* Configure USART control registers */
  reg->CR1 = cr1;
  reg->CR2 = cr2;
  reg->CR3 = cr3;

  /* USART Enable */
  reg->CR1 |= USART_CR1_UE;
  /* Dummy reading of the status register to reset TC flag in the status register
   * when sending data in the DMA mode */
  reg->SR;

  /* Set configured flag */
  info->flags |= USART_FLAG_CONFIGURED;

  return (DRIVER_OK);
}

/**
 * @fn          USART_STATUS USART_GetStatus(const USART_RESOURCES *usart)
 * @brief       Get USART status.
 * @param[in]   usart     Pointer to USART resources
 * @return      USART status \ref USART_STATUS
 */
static
USART_STATUS USART_GetStatus(const USART_RESOURCES *usart)
{
  USART_STATUS status;

