koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/USART_STM32F1xx.c
  if (usart->xfer->send_active != 0U) {
    status.tx_busy = 1U;
  }
  else {
    status.tx_busy = ((usart->reg->SR & USART_SR_TC) ? (0U) : (1U));
  }
  status.rx_busy = usart->info->status.rx_busy;
  status.tx_underflow = usart->info->status.tx_underflow;
  status.rx_overflow = usart->info->status.rx_overflow;
  status.rx_break = usart->info->status.rx_break;
  status.rx_framing_error = usart->info->status.rx_framing_error;
  status.rx_parity_error = usart->info->status.rx_parity_error;

  return status;
}

/**
 * @fn          int32_t USART_SetModemControl(USART_MODEM_CONTROL control, const USART_RESOURCES *usart)
 * @brief       Set USART Modem Control line state.
 * @param[in]   control   \ref USART_MODEM_CONTROL
 * @param[in]   usart     Pointer to USART resources
 * @return      \ref execution_status
 */
static
int32_t USART_SetModemControl(USART_MODEM_CONTROL control, const USART_RESOURCES *usart)
{
  USART_INFO *info = usart->info;

  switch (control) {
    case USART_RTS_CLEAR:
      if ((info->flow_control == USART_FLOW_CONTROL_NONE) || (info->flow_control == USART_FLOW_CONTROL_CTS)) {
        if (usart->io.rts) {
          GPIO_PinWrite(usart->io.rts->port, usart->io.rts->pin, GPIO_PIN_OUT_HIGH);
        }
      }
      else {
        /* Hardware RTS */
        return (DRIVER_ERROR);
      }
      break;

    case USART_RTS_SET:
      if ((info->flow_control == USART_FLOW_CONTROL_NONE) || (info->flow_control == USART_FLOW_CONTROL_CTS)) {
        if (usart->io.rts) {
          GPIO_PinWrite(usart->io.rts->port, usart->io.rts->pin, GPIO_PIN_OUT_LOW);
        }
      }
      else {
        /* Hardware RTS */
        return (DRIVER_ERROR);
      }
      break;

    case USART_DTR_CLEAR:
    case USART_DTR_SET:
    default:
      return (DRIVER_ERROR);
  }

  return (DRIVER_OK);
}

/**
 * @fn          USART_MODEM_STATUS USART_GetModemStatus(const USART_RESOURCES *usart)
 * @brief       Get USART Modem Status lines state.
 * @param[in]   usart     Pointer to USART resources
 * @return      modem status \ref USART_MODEM_STATUS
 */
static
USART_MODEM_STATUS USART_GetModemStatus(const USART_RESOURCES *usart)
{
  USART_MODEM_STATUS modem_status;

  modem_status.cts = 0U;
  if ((usart->info->flow_control == USART_FLOW_CONTROL_NONE) || (usart->info->flow_control == USART_FLOW_CONTROL_RTS)) {
    if (usart->io.cts) {
      if (GPIO_PinRead(usart->io.cts->port, usart->io.cts->pin) == 0U) {
        modem_status.cts = 1U;
      }
    }
  }
  modem_status.dsr = 0U;
  modem_status.ri = 0U;
  modem_status.dcd = 0U;

  return modem_status;
}

/**
 * @fn          void USART_IRQHandler(const USART_RESOURCES *usart)
 * @brief       USART Interrupt handler.
 * @param[in]   usart     Pointer to USART resources
 */
void USART_IRQHandler(const USART_RESOURCES *usart)
{
  uint32_t val, sr, event;
  uint16_t data;
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  USART_TypeDef *reg = usart->reg;

  /* Read USART status register */
  sr = reg->SR;

  /* Reset local variables */
  val = 0U;
  event = 0U;
  data = 0U;

  /* Read Data register not empty */
  if (sr & USART_SR_RXNE & reg->CR1) {
    /* Check for RX overflow */
    if (info->status.rx_busy == 0U) {
      /* New receive has not been started */
      /* Dump RX data */
      reg->DR;
      info->status.rx_overflow = 1;
      event |= USART_EVENT_RX_OVERFLOW;
    }
    else {
      if ((info->mode == USART_MODE_SYNCHRONOUS_MASTER) && (xfer->sync_mode == USART_SYNC_MODE_TX)) {
        /* Dummy read in synchronous transmit only mode */
        reg->DR;
      }
      else {
        /* Read data from RX FIFO into receive buffer */
        data = (uint16_t)reg->DR;
      }

      *(xfer->rx_buf++) = (uint8_t)data;

      /* If nine bit data, no parity */
      val = reg->CR1;
      if (((val & USART_CR1_PCE) == 0U) && ((val & USART_CR1_M) != 0U)) {
        *(xfer->rx_buf++) = (uint8_t)(data >> 8U);
      }
      xfer->rx_cnt++;

      /* Check if requested amount of data is received */
      if (xfer->rx_cnt == xfer->rx_num) {
        /* Disable IDLE interrupt */
        reg->CR1 &= ~USART_CR1_IDLEIE;
        /* Clear RX busy flag and set receive transfer complete event */
        info->status.rx_busy = 0U;
        if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
          val = xfer->sync_mode;
          xfer->sync_mode = 0U;
          switch (val) {
            case USART_SYNC_MODE_TX:
              event |= USART_EVENT_SEND_COMPLETE;
              break;
            case USART_SYNC_MODE_RX:
              event |= USART_EVENT_RECEIVE_COMPLETE;
              break;
            case USART_SYNC_MODE_TX_RX:
              event |= USART_EVENT_TRANSFER_COMPLETE;
              break;
            default:
              break;
          }
        }
        else {
          event |= USART_EVENT_RECEIVE_COMPLETE;
        }
      }
    }
  }

  /* IDLE line */
  if (sr & USART_SR_IDLE & reg->CR1) {
    /* Dummy read to clear IDLE interrupt */
    reg->DR;
    event |= USART_EVENT_RX_TIMEOUT;
  }

  /* Transmit data register empty */
  if (sr & USART_SR_TXE & reg->CR1) {
    /* Break handling */
    if (xfer->break_flag) {
      /* Send break */
      reg->CR1 |= USART_CR1_SBK;
    }
    else {
      if (xfer->tx_num != xfer->tx_cnt) {
        if ((info->mode == USART_MODE_SYNCHRONOUS_MASTER) && (xfer->sync_mode == USART_SYNC_MODE_RX)) {
          /* Dummy write in synchronous receive only mode */
          data = xfer->def_val;
        }
        else {
          /* Write data to TX FIFO */
          data = *(xfer->tx_buf++);

          /* If nine bit data, no parity */
          val = reg->CR1;
          if (((val & USART_CR1_PCE) == 0U) && ((val & USART_CR1_M) != 0U)) {
            data |= *(xfer->tx_buf++) << 8U;
          }
        }
      }
      xfer->tx_cnt++;

      /* Write to data register */
      reg->DR = data;

      /* Check if all data is transmitted */
      if (xfer->tx_num == xfer->tx_cnt) {
        /* Disable TXE interrupt */
        reg->CR1 &= ~USART_CR1_TXEIE;

        /* Enable TC interrupt */
        reg->CR1 |= USART_CR1_TCIE;

        xfer->send_active = 0U;

        /* Set send complete event */
        if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
          if ((xfer->sync_mode == USART_SYNC_MODE_TX) && ((info->flags & USART_FLAG_RX_ENABLED) == 0U)) {
            event |= USART_EVENT_SEND_COMPLETE;
          }
        }
        else {
          event |= USART_EVENT_SEND_COMPLETE;
        }
      }
    }
  }

  /* Transmission complete */
  if (sr & USART_SR_TC & reg->CR1) {
    /* Disable transmission complete interrupt */
    reg->CR1 &= ~USART_CR1_TCIE;
    event |= USART_EVENT_TX_COMPLETE;
  }

  /* RX Overrun */
  if ((sr & USART_SR_ORE) != 0U) {
    /* Shift register has been overwritten */
    /* Dummy data read to clear the ORE flag */
    reg->DR;
    info->status.rx_overflow = 1U;
    event |= USART_EVENT_RX_OVERFLOW;
  }

