koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F1xx/Driver/USART_STM32F1xx.c
  /* Framing error */
  if ((sr & USART_SR_FE) != 0U) {
    /* Dummy data read to clear the FE flag */
    reg->DR;
    info->status.rx_framing_error = 1U;
    event |= USART_EVENT_RX_FRAMING_ERROR;
  }

  /* Parity error */
  if ((sr & USART_SR_PE) != 0U) {
    /* Dummy data read to clear the PE flag */
    reg->DR;
    info->status.rx_parity_error = 1U;
    event |= USART_EVENT_RX_PARITY_ERROR;
  }

  /* Break Detection */
  if ((sr & USART_SR_LBD) != 0U) {
    /* Clear Break detection flag */
    reg->SR &= ~USART_SR_LBD;
    info->status.rx_break = 1U;
    event |= USART_EVENT_RX_BREAK;
  }

  /* CTS changed */
  if ((sr & USART_SR_CTS) != 0U) {
    /* Clear CTS flag */
    reg->SR &= ~USART_SR_CTS;
    event |= USART_EVENT_CTS;
  }

  /* Send Event */
  if ((event && info->cb_event) != 0U) {
    info->cb_event(event);
  }
}

#ifdef __USART_DMA_TX
void USART_TX_DMA_Complete(const USART_RESOURCES *usart)
{
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;

  if ((DMA_ChannelTransferItemCount(usart->dma_tx->instance) != 0U) && (xfer->tx_num != 0U)) {
    /* TX DMA Complete caused by send/transfer abort */
    return;
  }

  xfer->tx_cnt = xfer->tx_num;
  /* Clear TX busy flag */
  xfer->send_active = 0U;

  /* TC interrupt enable */
  usart->reg->CR1 |= USART_CR1_TCIE;

  /* Set Send Complete event for asynchronous transfers */
  if (info->mode != USART_MODE_SYNCHRONOUS_MASTER) {
    if (info->cb_event) {
      info->cb_event(USART_EVENT_SEND_COMPLETE);
    }
  }
}
#endif

#ifdef __USART_DMA_RX
void USART_RX_DMA_Complete(const USART_RESOURCES *usart)
{
  USART_INFO *info = usart->info;
  USART_TRANSFER_INFO *xfer = usart->xfer;
  uint32_t val, event;

  if ((DMA_ChannelTransferItemCount(usart->dma_rx->instance) != 0U) && (xfer->rx_num != 0U)) {
    /* RX DMA Complete caused by receive/transfer abort */
    return;
  }

  /* Disable IDLE interrupt */
  usart->reg->CR1 &= ~USART_CR1_IDLEIE;

  event = 0U;

  if (info->mode == USART_MODE_SYNCHRONOUS_MASTER) {
    val = xfer->sync_mode;
    xfer->sync_mode = 0U;
    switch (val) {
      case USART_SYNC_MODE_TX:
        event = USART_EVENT_SEND_COMPLETE;
        break;
      case USART_SYNC_MODE_RX:
        event = USART_EVENT_RECEIVE_COMPLETE;
        break;
      case USART_SYNC_MODE_TX_RX:
        event = USART_EVENT_TRANSFER_COMPLETE;
        break;
      default:
        break;
    }
  }
  else {
    event = USART_EVENT_RECEIVE_COMPLETE;
  }

  xfer->rx_cnt = xfer->rx_num;
  info->status.rx_busy = 0U;

  /* Enable RXNE interrupt to detect RX overrun */
  usart->reg->CR1 |= USART_CR1_RXNEIE;

  if (info->cb_event && event) {
    info->cb_event(event);
  }
}
#endif

#ifdef USE_USART1
/* USART1 Driver Wrapper functions */
static USART_CAPABILITIES  USART1_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART1_Resources); }
static int32_t                 USART1_Initialize      (USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART1_Resources); }
static int32_t                 USART1_Uninitialize    (void)                                                { return USART_Uninitialize (&USART1_Resources); }
static int32_t                 USART1_PowerControl    (POWER_STATE state)                               { return USART_PowerControl (state, &USART1_Resources); }
static int32_t                 USART1_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART1_Resources); }
static int32_t                 USART1_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART1_Resources); }
static int32_t                 USART1_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART1_Resources); }
static uint32_t                USART1_GetTxCount      (void)                                                { return USART_GetTxCount (&USART1_Resources); }
static uint32_t                USART1_GetRxCount      (void)                                                { return USART_GetRxCount (&USART1_Resources); }
static int32_t                 USART1_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART1_Resources); }
static USART_STATUS        USART1_GetStatus       (void)                                                { return USART_GetStatus (&USART1_Resources); }
static int32_t                 USART1_SetModemControl (USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART1_Resources); }
static USART_MODEM_STATUS  USART1_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART1_Resources); }
       void                    USART1_IRQHandler      (void)                                                {        USART_IRQHandler (&USART1_Resources); }

#ifdef USART1_TX_DMA_Instance
       void                    USART1_TX_DMA_Handler  (uint32_t events)                                     {        USART_TX_DMA_Complete(&USART1_Resources); }
#endif
#ifdef USART1_RX_DMA_Instance
       void                    USART1_RX_DMA_Handler  (uint32_t events)                                     {        USART_RX_DMA_Complete(&USART1_Resources); }
#endif

/* USART1 Driver Control Block */
DRIVER_USART Driver_USART1 = {
    USARTx_GetVersion,
    USART1_GetCapabilities,
    USART1_Initialize,
    USART1_Uninitialize,
    USART1_PowerControl,
    USART1_Send,
    USART1_Receive,
    USART1_Transfer,
    USART1_GetTxCount,
    USART1_GetRxCount,
    USART1_Control,
    USART1_GetStatus,
    USART1_SetModemControl,
    USART1_GetModemStatus
};
#endif  /* USE_USART1 */

#ifdef USE_USART2
/* USART2 Driver Wrapper functions */
static USART_CAPABILITIES  USART2_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART2_Resources); }
static int32_t                 USART2_Initialize      (USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART2_Resources); }
static int32_t                 USART2_Uninitialize    (void)                                                { return USART_Uninitialize (&USART2_Resources); }
static int32_t                 USART2_PowerControl    (POWER_STATE state)                               { return USART_PowerControl (state, &USART2_Resources); }
static int32_t                 USART2_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART2_Resources); }
static int32_t                 USART2_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART2_Resources); }
static int32_t                 USART2_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART2_Resources); }
static uint32_t                USART2_GetTxCount      (void)                                                { return USART_GetTxCount (&USART2_Resources); }
static uint32_t                USART2_GetRxCount      (void)                                                { return USART_GetRxCount (&USART2_Resources); }
static int32_t                 USART2_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART2_Resources); }
static USART_STATUS        USART2_GetStatus       (void)                                                { return USART_GetStatus (&USART2_Resources); }
static int32_t                 USART2_SetModemControl (USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART2_Resources); }
static USART_MODEM_STATUS  USART2_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART2_Resources); }
       void                    USART2_IRQHandler      (void)                                                {        USART_IRQHandler (&USART2_Resources); }

#ifdef USART2_TX_DMA_Instance
       void                    USART2_TX_DMA_Handler  (uint32_t events)                                     {        USART_TX_DMA_Complete(&USART2_Resources); }
#endif
#ifdef USART2_RX_DMA_Instance
       void                    USART2_RX_DMA_Handler  (uint32_t events)                                     {        USART_RX_DMA_Complete(&USART2_Resources); }
#endif

